Revit 2026 API

# DocumentGetDocumentVersion Method

---

Gets the DocumentVersion that corresponds to a document.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static DocumentVersion GetDocumentVersion(
	Document doc
)
```
```vb
Public Shared Function GetDocumentVersion (
	doc As Document
) As DocumentVersion
```
```cpp
public:
static DocumentVersion^ GetDocumentVersion(
	Document^ doc
)
```
```fsharp
static member GetDocumentVersion :
        doc : Document -> DocumentVersion
```

#### Parameters

doc Document
     The document whose DocumentVersion will be returned.

#### Return Value

DocumentVersion The DocumentVersion corresponding to the given document.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

This function can be combined with IsModified to see whether a document in memory is different from a version on disk. The documents are different if the document is modified or if the two DocumentVersions differ.

#### Reference

Document Class

Autodesk.Revit.DB Namespace